Revit 2027 API
TemperatureRating Properties
The TemperatureRating type exposes the following members.
Properties
Name | Description
Id |  The Conductor Temperature Rating id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The Conductor Temperature Rating name.
Top
See Also
Reference
TemperatureRating Class
Autodesk.Revit.DB.Electrical Namespace